OpenNuvoton/M55M1BSP/SampleCode/StdDriver/HSUSBD_MassStorage_ScatterGather/massstorage.c
            for (j = 0; j < 12; j++, i++)
                *((uint8_t *)(g_u32MassBase + i)) = g_au8ModePage_01[j];

            break;

        case 0x05:
            *((uint8_t *)g_u32MassBase) = 39;
            i = 8;

            for (j = 0; j < 32; j++, i++)
                *((uint8_t *)(g_u32MassBase + i)) = g_au8ModePage_05[j];

            NumHead = 2;
            NumSector = 64;
            NumCyl = g_TotalSectors / 128;

            *((uint8_t *)(g_u32MassBase + 12)) = NumHead;
            *((uint8_t *)(g_u32MassBase + 13)) = NumSector;
            *((uint8_t *)(g_u32MassBase + 16)) = (uint8_t)(NumCyl >> 8);
            *((uint8_t *)(g_u32MassBase + 17)) = (uint8_t)(NumCyl & 0x00ff);
            break;

        case 0x1B:
            *((uint8_t *)g_u32MassBase) = 19;
            i = 8;

            for (j = 0; j < 12; j++, i++)
                *((uint8_t *)(g_u32MassBase + i)) = g_au8ModePage_1B[j];

            break;

        case 0x1C:
            *((uint8_t *)g_u32MassBase) = 15;
            i = 8;

            for (j = 0; j < 8; j++, i++)
                *((uint8_t *)(g_u32MassBase + i)) = g_au8ModePage_1C[j];

            break;

        case 0x3F:
            *((uint8_t *)g_u32MassBase) = 0x47;
            i = 8;

            for (j = 0; j < 12; j++, i++)
                *((uint8_t *)(g_u32MassBase + i)) = g_au8ModePage_01[j];

            for (j = 0; j < 32; j++, i++)
                *((uint8_t *)(g_u32MassBase + i)) = g_au8ModePage_05[j];

            for (j = 0; j < 12; j++, i++)
                *((uint8_t *)(g_u32MassBase + i)) = g_au8ModePage_1B[j];

            for (j = 0; j < 8; j++, i++)
                *((uint8_t *)(g_u32MassBase + i)) = g_au8ModePage_1C[j];

            NumHead = 2;
            NumSector = 64;
            NumCyl = g_TotalSectors / 128;

            *((uint8_t *)(g_u32MassBase + 24)) = NumHead;
            *((uint8_t *)(g_u32MassBase + 25)) = NumSector;
            *((uint8_t *)(g_u32MassBase + 28)) = (uint8_t)(NumCyl >> 8);
            *((uint8_t *)(g_u32MassBase + 29)) = (uint8_t)(NumCyl & 0x00ff);
            break;

        default:
            g_au8SenseKey[0] = 0x05;
            g_au8SenseKey[1] = 0x24;
            g_au8SenseKey[2] = 0x00;
    }

    MSC_BulkIn(g_u32MassBase, g_sCBW.dCBWDataTransferLength);
}

void MSC_ModeSense6(void)
{
    uint8_t i;

    for (i = 0; i < 4; i++)
        *((uint8_t *)(g_u32MassBase + i)) = g_au8ModePage[i];

    MSC_BulkIn(g_u32MassBase, g_sCBW.dCBWDataTransferLength);
}

void MSC_BulkOut(uint32_t u32Addr, uint32_t u32Len)
{
    uint32_t u32Loop;
    uint32_t i;

    /* bulk out, dma write, epnum = 2 */
    HSUSBD_SET_DMA_WRITE(BULK_OUT_EP_NUM);
    g_hsusbd_ShortPacket = 0;

    u32Loop = u32Len / USBD_MAX_DMA_LEN;

    for (i = 0; i < u32Loop; i++)
    {
        MSC_ActiveDMA(u32Addr + i * USBD_MAX_DMA_LEN, USBD_MAX_DMA_LEN);
    }

    u32Loop = u32Len % USBD_MAX_DMA_LEN;

    if (u32Loop)
    {
        MSC_ActiveDMA(u32Addr + i * USBD_MAX_DMA_LEN, u32Loop);
    }

#if (NVT_DCACHE_ON == 1)
    /* Host to device.Invalidate the cache to allow the CPU to access the latest data. */
    SCB_InvalidateDCache_by_Addr((uint8_t *)u32Addr, DCACHE_ALIGN_LINE_SIZE(u32Len));
#endif
}

void MSC_BulkIn(uint32_t u32Addr, uint32_t u32Len)
{
    uint32_t u32Loop;
    uint32_t i, addr, count;

    /* bulk in, dma read, epnum = 1 */
    HSUSBD_SET_DMA_READ(BULK_IN_EP_NUM);

    u32Loop = u32Len / USBD_MAX_DMA_LEN;

#if (NVT_DCACHE_ON == 1)
    /* Device to host, so need clean data to sram. */
    SCB_CleanDCache_by_Addr((uint8_t *)u32Addr, DCACHE_ALIGN_LINE_SIZE(u32Len));
#endif

    for (i = 0; i < u32Loop; i++)
    {
        HSUSBD_ENABLE_EP_INT(EPA, HSUSBD_EPINTEN_TXPKIEN_Msk);
        g_hsusbd_ShortPacket = 0;

        while (1)
        {
            if (HSUSBD_GET_EP_INT_FLAG(EPA) & HSUSBD_EPINTSTS_BUFEMPTYIF_Msk)
            {
                MSC_ActiveDMA(u32Addr + i * USBD_MAX_DMA_LEN, USBD_MAX_DMA_LEN);
                break;
            }
        }
    }

    addr = u32Addr + i * USBD_MAX_DMA_LEN;
    u32Loop = u32Len % USBD_MAX_DMA_LEN;

    if (u32Loop)
    {
        count = u32Loop / g_u32EpMaxPacketSize;

        if (count)
        {
            HSUSBD_ENABLE_EP_INT(EPA, HSUSBD_EPINTEN_TXPKIEN_Msk);
            g_hsusbd_ShortPacket = 0;

            while (1)
            {
                if (HSUSBD_GET_EP_INT_FLAG(EPA) & HSUSBD_EPINTSTS_BUFEMPTYIF_Msk)
                {
                    MSC_ActiveDMA(addr, count * g_u32EpMaxPacketSize);
                    break;
                }
            }

            addr += (count * g_u32EpMaxPacketSize);
        }

        count = u32Loop % g_u32EpMaxPacketSize;

        if (count)
        {
            HSUSBD_ENABLE_EP_INT(EPA, HSUSBD_EPINTEN_TXPKIEN_Msk);
            g_hsusbd_ShortPacket = 1;

            while (1)
            {
                if (HSUSBD_GET_EP_INT_FLAG(EPA) & HSUSBD_EPINTSTS_BUFEMPTYIF_Msk)
                {
                    MSC_ActiveDMA(addr, count);
                    break;
                }
            }
        }
    }
}

void MSC_BulkOutSG(uint32_t u32Addr)
{
    /* bulk out, dma write, epnum = 2 */
    HSUSBD_SET_DMA_WRITE(BULK_OUT_EP_NUM);
    /* Enable BUS interrupt */
    HSUSBD_ENABLE_BUS_INT(HSUSBD_BUSINTEN_DMADONEIEN_Msk | HSUSBD_BUSINTEN_SUSPENDIEN_Msk | HSUSBD_BUSINTEN_RSTIEN_Msk | HSUSBD_BUSINTEN_VBUSDETIEN_Msk);

    HSUSBD_SET_DMA_ADDR(u32Addr);
    HSUSBD_SET_DMA_LEN(8);
    g_hsusbd_DmaDone = 0;
    HSUSBD->DMACTL |= (HSUSBD_DMACTL_DMAEN_Msk | HSUSBD_DMACTL_SGEN_Msk | HSUSBD_DMACTL_DMARD_Msk);

    while (g_hsusbd_Configured)
    {
        if (g_hsusbd_DmaDone)
            break;

        if (!HSUSBD_IS_ATTACHED())
            break;
    }
}

void MSC_BulkInSG(uint32_t u32Addr)
{
    /* bulk in, dma read, epnum = 1 */
    HSUSBD_SET_DMA_READ(BULK_IN_EP_NUM);
    /* Enable BUS interrupt */
    HSUSBD_ENABLE_BUS_INT(HSUSBD_BUSINTEN_DMADONEIEN_Msk | HSUSBD_BUSINTEN_SUSPENDIEN_Msk | HSUSBD_BUSINTEN_RSTIEN_Msk | HSUSBD_BUSINTEN_VBUSDETIEN_Msk);

    HSUSBD_SET_DMA_ADDR(u32Addr);
    HSUSBD_SET_DMA_LEN(8);    /* scatter-gather descriptor size */
    g_hsusbd_DmaDone = 0;
    HSUSBD->DMACTL |= (HSUSBD_DMACTL_DMAEN_Msk | HSUSBD_DMACTL_SGEN_Msk);

    while (g_hsusbd_Configured)
    {
        if (g_hsusbd_DmaDone)
            break;

