OpenNuvoton/M55M1BSP/SampleCode/StdDriver/HSUSBD_MassStorage_ScatterGather/massstorage.c
        if (!HSUSBD_IS_ATTACHED())
            break;
    }
}


void MSC_ReceiveCBW(uint32_t u32Buf, uint32_t u32Len)
{
    /* bulk out, dma write, epnum = 2 */
    HSUSBD_SET_DMA_WRITE(BULK_OUT_EP_NUM);

    /* Enable BUS interrupt */
    HSUSBD_ENABLE_BUS_INT(HSUSBD_BUSINTEN_DMADONEIEN_Msk | HSUSBD_BUSINTEN_SUSPENDIEN_Msk | HSUSBD_BUSINTEN_RSTIEN_Msk | HSUSBD_BUSINTEN_VBUSDETIEN_Msk);

    HSUSBD_SET_DMA_ADDR(u32Buf);
    HSUSBD_SET_DMA_LEN(u32Len);

    g_hsusbd_DmaDone = 0;
    HSUSBD_ENABLE_DMA();

    while (g_hsusbd_Configured)
    {
        if (g_hsusbd_DmaDone == 1)
            break;

        if (!HSUSBD_IS_ATTACHED())
            break;
    }

#if (NVT_DCACHE_ON == 1)
    /* Host to device.Invalidate the cache to allow the CPU to access the latest data. */
    SCB_InvalidateDCache_by_Addr((uint8_t *)u32Buf, DCACHE_ALIGN_LINE_SIZE(u32Len));
#endif
}

void MSC_ProcessCmd(void)
{
    uint32_t i;
    uint32_t Hcount, Dcount;

    if (g_u8MscOutPacket)
    {
        g_u8MscOutPacket = 0;

        if (g_u8BulkState == BULK_CBW)
        {
            /* Check CBW */
            g_u32CbwSize = HSUSBD->EP[EPB].EPDATCNT & 0xffff;
            MSC_ReceiveCBW(g_u32MassBase, g_u32CbwSize);

            /* Check Signature & length of CBW */
            if ((*(uint32_t *)(g_u32MassBase) != CBW_SIGNATURE) || (g_u32CbwSize != 31))
            {
                /* Invalid CBW */
                g_u8Prevent = 1;
                HSUSBD_SetEpStall(EPA);
                HSUSBD_SetEpStall(EPB);
                g_u32HsEpStallLock = (1 << EPA) | (1 << EPB);
                return;
            }

            /* Get the CBW */
            for (i = 0; i < 31; i++)
                *((uint8_t *)(&g_sCBW.dCBWSignature) + i) = *(uint8_t *)(g_u32MassBase + i);

            /* Prepare to echo the tag from CBW to CSW */
            g_sCSW.dCSWTag = g_sCBW.dCBWTag;
            Hcount = g_sCBW.dCBWDataTransferLength;

            /* Parse Op-Code of CBW */
            switch (g_sCBW.u8OPCode)
            {
                case UFI_READ_12:
                case UFI_READ_10:
                {
                    uint32_t length, scater_length, total_length = g_sCBW.dCBWDataTransferLength;

                    Dcount = (get_be32(&g_sCBW.au8Data[4]) >> 8) * 512;

                    if (g_sCBW.bmCBWFlags == 0x80)      /* IN */
                    {
                        if (Hcount == Dcount)   /* Hi == Di (Case 6)*/
                        {
                            g_sCSW.bCSWStatus = 0;
                        }
                        else if (Hcount < Dcount)     /* Hn < Di (Case 2) || Hi < Di (Case 7) */
                        {
                            if (Hcount)     /* Hi < Di (Case 7) */
                            {
                                g_u8Prevent = 1;
                                g_sCSW.bCSWStatus = 0x01;
                            }
                            else     /* Hn < Di (Case 2) */
                            {
                                g_u8Prevent = 1;
                                g_sCSW.bCSWStatus = 0x01;
                                g_sCSW.dCSWDataResidue = 0;
                                MSC_AckCmd();
                                return;
                            }
                        }
                        else if (Hcount > Dcount)     /* Hi > Dn (Case 4) || Hi > Di (Case 5) */
                        {
                            g_u8Prevent = 1;
                            g_sCSW.bCSWStatus = 0x01;
                        }
                    }
                    else     /* Ho <> Di (Case 10) */
                    {
                        g_u8Prevent = 1;
                        HSUSBD_SetEpStall(EPB);
                        g_sCSW.bCSWStatus = 0x01;
                        g_sCSW.dCSWDataResidue = Hcount;
                        MSC_AckCmd();
                        return;
                    }

                    /* Get LBA address */
                    g_u32LbaAddress = get_be32(&g_sCBW.au8Data[0]) * USBD_SECTOR_SIZE + g_u32StorageBase;

                    //MSC_ReadMedia(g_u32LbaAddress, g_sCBW.dCBWDataTransferLength, (uint8_t *)g_u32StorageBase);

                    while (total_length > 0)
                    {
                        if (total_length > 16384)
                            length = scater_length = 16384;
                        else
                            length = scater_length = total_length;

                        i = 0;

                        while (scater_length > 0)
                        {
                            if (scater_length > 2048)
                            {
                                scater_gather_array[i].COUNT = 0x40000800;
                                memcpy((uint8_t *)scater_gather_array[i].ADDRESS, (uint8_t *)g_u32LbaAddress + i * 0x800, 0x800);
#if (NVT_DCACHE_ON == 1)
                                /* Device to host, so need clean data to sram. */
                                SCB_CleanDCache_by_Addr((uint8_t *)scater_gather_array[i].ADDRESS, 0x800);
#endif
                                scater_length = scater_length - 0x800;
                            }
                            else
                            {
                                scater_gather_array[i].COUNT = 0xC0000000 | scater_length;
                                memcpy((uint8_t *)scater_gather_array[i].ADDRESS, (uint8_t *)g_u32LbaAddress + i * 0x800, scater_length);
#if (NVT_DCACHE_ON == 1)
                                /* Device to host, so need clean data to sram. */
                                SCB_CleanDCache_by_Addr((uint8_t *)scater_gather_array[i].ADDRESS, DCACHE_ALIGN_LINE_SIZE(scater_length));
#endif
                                scater_length = 0;
                            }

                            i++;
                        }

                        MSC_BulkInSG((uint32_t)&scater_gather_array);
                        g_u32LbaAddress += length;
                        total_length -= length;
                    }

                    g_sCSW.dCSWDataResidue = 0;
                    break;
                }

                case UFI_WRITE_12:
                case UFI_WRITE_10:
                {
                    uint32_t length, scater_length, total_length = g_sCBW.dCBWDataTransferLength;

                    Dcount = (get_be32(&g_sCBW.au8Data[4]) >> 8) * 512;

