OpenNuvoton/M55M1BSP/SampleCode/StdDriver/HSUSBD_MassStorage_ScatterGather/massstorage.c
                    if (g_sCBW.bmCBWFlags == 0x00)      /* OUT */
                    {
                        if (Hcount == Dcount)   /* Ho == Do (Case 12)*/
                        {
                            g_sCSW.bCSWStatus = 0;
                        }
                        else if (Hcount < Dcount)     /* Hn < Do (Case 3) || Ho < Do (Case 13) */
                        {
                            g_u8Prevent = 1;
                            g_sCSW.bCSWStatus = 0x1;

                            if (Hcount == 0)    /* Hn < Do (Case 3) */
                            {
                                g_sCSW.dCSWDataResidue = 0;
                                MSC_AckCmd();
                                return;
                            }
                        }
                        else if (Hcount > Dcount)     /* Ho > Do (Case 11) */
                        {
                            g_u8Prevent = 1;
                            g_sCSW.bCSWStatus = 0x1;
                        }

                        g_u32LbaAddress = get_be32(&g_sCBW.au8Data[0]) * USBD_SECTOR_SIZE + g_u32StorageBase;

                        while (total_length > 0)
                        {
                            if (total_length > 16384)
                                length = scater_length = 16384;
                            else
                                length = scater_length = total_length;

                            i = 0;

                            while (scater_length > 0)
                            {
                                if (scater_length > 2048)
                                {
                                    scater_gather_array[i].COUNT = 0x00000800;
                                    scater_length = scater_length - 0x800;
                                }
                                else
                                {
                                    scater_gather_array[i].COUNT = 0x80000000 | scater_length;
                                    scater_length = 0;
                                }

                                i++;
                            }

                            MSC_BulkOutSG((uint32_t)&scater_gather_array);
                            scater_length = length;
                            i = 0;

                            while (scater_length > 0)
                            {
                                if (scater_length > 2048)
                                {
#if (NVT_DCACHE_ON == 1)
                                    /* Host to device.Invalidate the cache to allow the CPU to access the latest data. */
                                    SCB_InvalidateDCache_by_Addr((uint8_t *)scater_gather_array[i].ADDRESS, 0x800);
#endif
                                    memcpy((uint8_t *)g_u32LbaAddress + i * 0x800, (uint8_t *)scater_gather_array[i].ADDRESS, 0x800);
                                    scater_length = scater_length - 0x800;
                                }
                                else
                                {
#if (NVT_DCACHE_ON == 1)
                                    /* Host to device.Invalidate the cache to allow the CPU to access the latest data. */
                                    SCB_InvalidateDCache_by_Addr((uint8_t *)(scater_gather_array[i].ADDRESS), DCACHE_ALIGN_LINE_SIZE(scater_length));
#endif
                                    memcpy((uint8_t *)g_u32LbaAddress + i * 0x800, (uint8_t *)scater_gather_array[i].ADDRESS, scater_length);
                                    scater_length = 0;
                                }

                                i++;
                            }

                            g_u32LbaAddress += length;
                            total_length -= length;
                        }

                        g_sCSW.dCSWDataResidue = 0;
                    }
                    else     /* Hi <> Do (Case 8) */
                    {
                        g_u8Prevent = 1;
                        g_sCSW.bCSWStatus = 0x1;
                        HSUSBD_SetEpStall(EPA);
                        g_sCSW.dCSWDataResidue = Hcount;
                        MSC_AckCmd();
                        return;
                    }

                    break;
                }

                case UFI_PREVENT_ALLOW_MEDIUM_REMOVAL:
                {
                    if (g_sCBW.au8Data[2] & 0x01)
                    {
                        g_au8SenseKey[0] = 0x05;  //INVALID COMMAND
                        g_au8SenseKey[1] = 0x24;
                        g_au8SenseKey[2] = 0;
                        g_u8Prevent = 1;
                    }
                    else
                        g_u8Prevent = 0;

                    g_sCSW.dCSWDataResidue = 0;
                    g_sCSW.bCSWStatus = g_u8Prevent;
                    break;
                }

                case UFI_TEST_UNIT_READY:
                {
                    if (Hcount != 0)
                    {
                        if (g_sCBW.bmCBWFlags == 0)     /* Ho > Dn (Case 9) */
                        {
                            g_u8Prevent = 1;
                            HSUSBD_SetEpStall(EPB);
                            g_sCSW.bCSWStatus = 0x1;
                            g_sCSW.dCSWDataResidue = Hcount;
                            MSC_AckCmd();
                        }
                    }
                    else     /* Hn == Dn (Case 1) */
                    {
                        if (g_u8Remove)
                        {
                            g_sCSW.dCSWDataResidue = 0;
                            g_sCSW.bCSWStatus = 1;
                            g_au8SenseKey[0] = 0x02;    /* Not ready */
                            g_au8SenseKey[1] = 0x3A;
                            g_au8SenseKey[2] = 0;
                            g_u8Prevent = 1;
                        }
                        else
                        {
                            g_sCSW.bCSWStatus = 0;
                            g_sCSW.dCSWDataResidue = 0;
                        }

                        MSC_AckCmd();
                    }

                    return;
                }

